app/controllers/confers_controller.rb

  def index
    @confers = Confer.all
---
SELECT `confers`.* FROM `confers`

  def new
    @confer = Confer.new
    @countries = Country.all
    @subjects = Subject.all
---
SELECT `countries`.* FROM `countries`
SELECT `subjects`.* FROM `subjects`

  def edit
    @countries = Country.all
    @subjects = Subject.all
---
SELECT `countries`.* FROM `countries`
SELECT `subjects`.* FROM `subjects`

  def create
    @confer = Confer.new(confer_params)

    respond_to do |format|
      if @confer.save
        format.html { redirect_to @confer, notice: 'Confer was successfully created.' }
        format.json { render :show, status: :created, location: @confer }
      else
        format.html {
          @countries = Country.all
          @subjects = Subject.all
---
INSERT INTO `confers` (`name`, `description`, `link`, `start_time`, `end_time`, `location`, `created_at`, `updated_at`) VALUES ('RailsConf 2016', 'RailsConf | Kansas City', 'http://railsconf.com/', '2016-08-12 00:00:00', '2016-08-12 00:00:00', 'Kansas', '2016-08-12 11:19:21', '2016-08-12 11:19:21')
SELECT `countries`.* FROM `countries`
SELECT `subjects`.* FROM `subjects`

  def update
    respond_to do |format|
      if @confer.update(confer_params)
---
UPDATE `confers` SET `description` = 'INBOUND\'s purpose is to provide the inspiration, education, and connections you need to transform your business. This November, we will host thousands of marketing and sales professionals from almost every industry imaginable and from all corners of the globe at the Boston Convention & Exhibition Center. In 2015, we had 14,000+ attendees from all around the world and we\'re excited to be bigger than ever this year.', `updated_at` = '2016-08-12 13:48:28' WHERE `confers`.`id` = 26

  def destroy
    @confer.destroy
---
DELETE FROM `confers` WHERE `confers`.`id` = 1

    def set_confer
      @confer = Confer.find(params[:id])
---
SELECT  `confers`.* FROM `confers` WHERE `confers`.`id` = 12 LIMIT 1